[
    {
        "id": 1,
        "image": "https://cdn1.careeraddict.com/uploads/article/60468/computer-science-course.jpg",
        "title": "Introduction to Programming",
        "description": "This comprehensive course is designed to introduce you to the exciting world of programming. Whether you're a complete beginner or have some prior experience, you'll learn the fundamentals of programming, including variables, loops, functions, and more. By the end of this course, you'll have the skills to write basic programs and explore further in the programming field.",
        "price": 99,
        "credit_hour": 3
    },
    {
        "id": 2,
        "image": "https://cdn1.careeraddict.com/uploads/article/60468/computer-science-course.jpg",
        "title": "Web Development Bootcamp",
        "description": "Become a web development pro with our intensive bootcamp! You'll dive deep into HTML, CSS, JavaScript, and popular web development frameworks. By the end of this course, you'll be able to create stunning websites and web applications, and you'll have a strong foundation for a career in web development.",
        "price": 149,
        "credit_hour": 4
    },
    {
        "id": 3,
        "image": "https://cdn1.careeraddict.com/uploads/article/60468/computer-science-course.jpg",
        "title": "Data Science Essentials",
        "description": "Unlock the power of data with this course! You'll learn data analysis, visualization, and machine learning techniques. Dive into real-world datasets and gain insights to make data-driven decisions. This course is essential for anyone looking to start a career in data science or enhance their data analysis skills.",
        "price": 129,
        "credit_hour": 3
    },
    {
        "id": 4,
        "image": "https://cdn1.careeraddict.com/uploads/article/60468/computer-science-course.jpg",
        "title": "Cybersecurity Fundamentals",
        "description": "Protect your digital world from threats! Explore the basics of cybersecurity, including network security, encryption, and ethical hacking. Learn to identify and mitigate cyber threats, making your online presence more secure. Ideal for those interested in cybersecurity careers or safeguarding their personal data.",
        "price": 119,
        "credit_hour": 2
    },
    {
        "id": 5,
        "image": "https://cdn1.careeraddict.com/uploads/article/60468/computer-science-course.jpg",
        "title": "Network Administration",
        "description": "Master the art of network administration! Dive into network protocols, configurations, and troubleshooting. Learn how to manage computer networks efficiently and ensure seamless connectivity. This course is perfect for aspiring network administrators and IT professionals.",
        "price": 129,
        "credit_hour": 3
    },
    {
        "id": 6,
        "image": "https://cdn1.careeraddict.com/uploads/article/60468/computer-science-course.jpg",
        "title": "Database Management",
        "description": "Unlock the secrets of efficient data storage! Explore relational databases, SQL, and database design. Learn to create and manage databases for various applications. This course is essential for database administrators and developers working with data-driven applications.",
        "price": 179,
        "credit_hour": 4
    },
    {
        "id": 7,
        "image": "https://cdn1.careeraddict.com/uploads/article/60468/computer-science-course.jpg",
        "title": "Cloud Computing and AWS",
        "description": "Embrace the cloud with Amazon Web Services (AWS)! Dive into cloud computing concepts and gain hands-on experience with AWS services. Learn how to deploy, manage, and scale applications in the cloud. Ideal for IT professionals and businesses looking to leverage cloud technology.",
        "price": 129,
        "credit_hour": 3
    },
    {
        "id": 8,
        "image": "https://cdn1.careeraddict.com/uploads/article/60468/computer-science-course.jpg",
        "title": "Software Development Best Practices",
        "description": "Write top-quality code with best practices! Explore software development methodologies, code reviews, and testing techniques. Learn to create maintainable and efficient software. This course is a must for software developers and engineers striving for excellence.",
        "price": 99,
        "credit_hour": 2
    },
    {
        "id": 9,
        "image": "https://cdn1.careeraddict.com/uploads/article/60468/computer-science-course.jpg",
        "title": "IT Project Management",
        "description": "Manage IT projects effectively from start to finish! Dive into project planning, execution, and monitoring. Learn to deliver projects on time and within budget. This course is perfect for IT project managers and professionals looking to enhance their project management skills.",
        "price": 109,
        "credit_hour": 3
    }
]